# Dispose Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemporaryGraphicsCommandData..::..Dispose Method
TemporaryGraphicsCommandData Class See Also
---
Releases all resources used by the TemporaryGraphicsCommandData
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
TemporaryGraphicsCommandData Class
Autodesk.Revit.UI Namespace